const TelegramBot = require('node-telegram-bot-api')
require('dotenv').config()

const token = process.env.TOKEN

const bot = new TelegramBot(token, { polling: true })
const commands = [{
  command: "start",
  description: "Bot startes"

},
{
  command: "calculate",
  description: "It calculates"
}]
bot.setMyCommands(commands)



bot.on('text', (msg) => {
  const chatId = msg.chat.id
  if (msg.text == "/start") {
    bot.sendMessage(chatId, "Bot started"
    )
  }
  else if (msg.text == "Արագած") {
    bot.sendPhoto(chatId, "https://upload.wikimedia.org/wikipedia/commons/3/31/Aragats.jpg", {
      caption: "Արագածը վաղ անցյալում եղել է աշխարհի խոշորագույն հրաբուխներից մեկը[փա՞ստ]։ Ունի 400 մ խորությամբ և 3 կմ տրամագծով հսկա խառնարան, որի քայքայված պատերի մնացորդները կազմում են լեռան չորս կատարները։ Խառնարանը հարավարևելյան կողմից բաց է և կապվում է շրջապատին գետակների ու ջրվեժների միջոցով։ Կատարները դասավորված են կիսաշրջանաձև և կազմում են 270 աստիճանի աղեղ։ Ամենաբարձրը հյուսիսային կատարն է (4090.1 մետր)։ Արևմտյան գագաթն ունի 3995.3 մետր, արևելյանը՝ 3908.2 մ, իսկ հարավայինը՝ 3887,8 մ բարձրություն։ Խառնարանը ջրահավաք մեծ ավազան է։ Այստեղից է սկիզբ առնում Քասաղի վտակ Գեղարոտ գետը։"
    })
  }
  else if (msg.text == "Խուստուփ") {
    bot.sendPhoto(chatId, "https://upload.wikimedia.org/wikipedia/commons/0/07/KapanGareginNzhdeh.jpg")
  }
  else if (msg.text == "Թեժլեռ") {
    bot.sendPhoto(chatId, "https://upload.wikimedia.org/wikipedia/commons/a/a5/Mount_Thezhler.jpg", {
      caption: "Թեժ լեռ, Թեժ Աճմեդ, Թեժ լեռ, Թեժսար, լեռնագագաթ Հայաստանի Լոռու և Կոտայքի մարզերի սահմանագլխին, Փամբակի լեռնաշղթայի ամենաբարձր կետը։ Բարձրություն 3101 մ։ Ներժայթուք է՝ կազմված էոցենի հրաբխային ապարներից (նեֆելինային սիենիտներ, գրանիտներ)։ Լանջերը զառիթափ են, լանդշաֆտը՝ լեռնամարգագետնային։ Մարգահովիտ գյուղից 7 կմ հարավ-արևմուտք[2][3]։"
    }
    )
  }
  else if (msg.text == "Արտավազ") {
    bot.sendPhoto(chatId, "https://upload.wikimedia.org/wikipedia/commons/thumb/d/d3/Artavaz_%28mount%29.jpg/1080px-Artavaz_%28mount%29.jpg", {
      caption: "Արտավազ, լեռնագագաթ Հայաստանի Կոտայքի մարզում Փամբակի լեռնաշղթայի հարավային լանջին, Արտավազ գյուղից 4 կմ հյուսիս-արևելք։ Բարձրությունը 2929 մ է[1]։"
    }
    )
  }
  else if (msg.text == "Արա") {
    bot.sendPhoto(chatId, "https://upload.wikimedia.org/wikipedia/commons/3/3b/Ara_Mountain_from_aircraft_-_July_2020.jpg", {
      caption: "Արայի, հանգած հրաբուխ Հայաստանի Կոտայքի և Արագածոտնու մարզերի սահմանագոտում, Արագածից հարավ–արևելք, Քասաղ և Հրազդան գետերի միջև[1]։ Արայի լեռը վերին երրորդական ժամանակաշրջանի հանգած հրաբուխ է։ Բարձրությունը՝ 2577 մետր։ Արայի լեռը կազմված է անդեզիտներից, անդեզիաներից և դացիաներից։ Լանջերը ծածկված են էլուվիալ նստվածքներով և մասնատված են ձորակներով։ Կլիման ցամաքային է, տեղումները՝ 300—400 մմ։ Ստորոտներում տարածված են գորշահողերով ծածկված օշինդթային կիսաանապատները, բարձրադիր մասերում՝ տափաստանները։ Հյուսիսային լանջին հանդիպում են կաղնու նոսր պուրակներ ու թփուտներ։ Արայի լեռան վրա է գտնվում Ծաղկեվանքը։ Ըստ հայկական ավանդության՝ լեռը այդպես է կոչվել ի հիշատակ առասպելական Արա Գեղեցիկի, ով Շամիրամի դեմ կռվելու համար իր զորքերը տեղավորել էր այս ստորոտում[2]։"
    }
    )
  }
  else if (msg.text == "Աչքասար") {
    bot.sendPhoto(chatId, "https://upload.wikimedia.org/wikipedia/commons/thumb/3/3d/Achkasar2.jpg/1200px-Achkasar2.jpg", {
      caption: "Աչքասար, Ախչալա, Ակչալա, Լեգլի, Լեյլի, լեռ Հայաստանի Լոռի և Շիրակ մարզերի միջև, Ջավախքի լեռնաշղթայի ամենաբարձր գագաթը Հայաստանում։ Ունի 3196 մ բարձրություն։ Սարագյուղից 10 կմ արևելք։ Անտրոպոգենի լավային կոն է՝ կազմված անդեզիտադացիտներից։ Լանջերը զառիթափ են և բարձր մասերում ծածկված են քարակարկառներով[1][2]։"
    }
    )
  }
  else if (msg.text == "Արարատ") {
    bot.sendPhoto(chatId, "https://patmakanhetq.com/wp-content/uploads/2020/03/%D4%B1%D6%80%D5%A1%D6%80%D5%A1%D5%BF-%D5%AC%D5%A5%D5%BC-3-%D5%8A%D5%A1%D5%BF%D5%B4%D5%A1%D5%AF%D5%A1%D5%B6-%D5%80%D5%A5%D5%BF%D6%84.jpg", {
      caption: "Արարատ (ավանդական հայերեն՝ Սիս և Մասիս) հանգած հրաբուխ Արաքս գետի աջ ափին, Հայաստանի սահմանից 32 կմ հեռավորության վրա, իսկ Իրանի սահմանից՝ 16 կմ։ Ունի երկու գագաթ՝ մեծ (Մասիս՝ 5165 մ) և փոքր (Սիս՝ 3925 մ)[3]։ Հայկական լեռնաշխարհի ամենաբարձր լեռն է[4]։ Արարատի լեռնային զանգվածն ունի շուրջ 40 կմ տրամագիծ։"

    })
  }
  else if (msg.text == "Արաքս") {
    bot.sendPhoto(chatId, "https://upload.wikimedia.org/wikipedia/commons/thumb/a/a1/Jolfa-Aras2.jpg/600px-Jolfa-Aras2.jpg", {
      caption: "Արաքսը սկիզբ է առնում Բյուրակնյան լեռներից բխող բազմաթիվ սառնորակ աղբյուրներից։ Այստեղ նրա ջրերն ունեն ոչ ավելի 3-3,5° ջերմություն։ Այն լեռնաշխարհի միակ գետն է, որ հոսում է լեռնաշխարհի ամբողջ տարածքով և միանալով Կուրին՝ թափվում Կասպից ծովը։ Արաքսը հոսում է Հայաստանի, Ադրբեջանի, Թուրքիայի և Իրանի տարածքներով։ Նրա երկարությունը 1072 կիլոմետր է, որից 200 կիլոմետրը Հայաստանի տարածքում է։ Գետի լայնությունը մերձարաքսյան հարթությունում հասնում է 30-130 մետրի (Մեղրուն մերձ կիրճերում՝ 6-7 մետրի)։ Խորությունը 3-4,5 մետր է։"

    })
  }
  else if (msg.text == "Եփրատ") {
    bot.sendPhoto(chatId, "https://i.pinimg.com/originals/bd/cb/a7/bdcba75fea02e6c47996400b68d60215.jpg", {
      caption: "Եփրատ[1] (նաև՝ Եվփրատ) Առաջավոր Ասիայի ամենաերկար գետը՝ 2700 կմ երկարությամբ, 673 հազար կմ2 ավազանով։ Հայկական լեռնաշխարհի սահմաններում նրա ավազանը կազմում է 95 հազար կմ2, որից 40 հազարն Արածանիի ջրհավաքն է։"

    })
  }
  else if (msg.text == "Տիգրիս") {
    bot.sendPhoto(chatId, "https://upload.wikimedia.org/wikipedia/commons/5/59/Tigris_2015.jpg", {
      caption: "Տիգրիս[1] ( հայերեն՝ Ջերմ, Դիջլա[3]), գետ Հայկական Լեռնաշխարհում և Միջագետքում։ Հոսում է Թուրքիայի և Իրաքի տարածքով։ Տիգրիսը կազմվում է Արևմտյան Տիգրիս և Արևելյան Տիգրիս գետերի միախառնումից։ Երկարությունը 1900 կմ, ավազանը՝ 375 հզ  կմ2։ Տիգրիս–Եփրատի միջագետքը մարդկային քաղաքակրթության հնագույն կենտրոններից է։"

    })
  }

  else if (msg.text == "Ճորոխ") {
    bot.sendPhoto(chatId, "https://upload.wikimedia.org/wikipedia/commons/thumb/3/35/Choruh_02.jpg/600px-Choruh_02.jpg", {
      caption: "Գետի երկարությունը 360 կմ է, ջրհավաք ավազանի մակերեսը՝ 19,8 հզ կմ²։ Սկիզբ է առնում Ճորոխի լեռնաշղթայի Չորմայրի գագաթից, սկզբում հոսում է դեպի արևմուտք, ապա շեղվում հյուսիս, անցնում Բաբերդի միջով, Լորի (Բլուր) վտակն ընդունելուց հետո ուղղությունը փոխում է դեպի արևելք ու հյուսիս–արևելք։ Մինչև ծովափ հասնելը կտրում է Արևելապոնտական լեռները՝ առաջացնելով խորը կիրճ։"

    })
  }
  else if (msg.text == "Կուր") {
    bot.sendPhoto(chatId, "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcQ7yOO5WzPPSdRGnaGH_gF_H8o0LcrXiKag1Q&s", {
      caption: "Կուր գետ (Գուգարքի և Թիֆլիսի բարբառներով՝ Քուռ, թուրքերեն՝ Kura, վրաց.՝ მტკვარი - Մտկվարի, ադրբ.՝ Kür), գետ Հայկական լեռնաշխարհում և Կասպից ծովի ավազանում։ Սկիզբ առնելով Կարմիր Փորակ լեռնաշղթայի հյուսիսային ստորոտներում (Կարսի մարզի Արդահանի շրջանի Գյոլեի տեղամասում, ներկայումս՝ Թուրքիայում), Կուրը հոսում է դեպի Վրաստան՝ հասնելով Ադրբեջան, որտեղ այն միանում է Արաքսին և թափվում Կասպից ծով։ Կուր գետի երկարությունը 1113[1] կմ է։ Կուր անվան ստուգաբանությունը Սալմաստի հայերեն բարբառի տարբերակում «կուռ»՝«ջրի ավազան» է նշանակում։"

    })
  }


})





